Code for scraping from indeed.co.uk

In [1]:
#import packages
import requests, bs4, time
import pandas as pd
import os
from itertools import cycle
import traceback
from datetime import date
import pickle
import numpy as np
import datetime
import cleaning_funcs_indeed_uk as cf

In [2]:
# readin all raw pickle files

ads= pd.DataFrame(columns = ['company', 'job_title', 'salary', 'location', 'description', 'date',
       'full_description', 'other_deets', 'jobtype', 'salary_low',
       'salary_high','extraction_date'])

import os

for i in os.listdir('C:/Users/lundr/DataScienceJobs/data/indeed_raw_pickles/'):
    
    read_in = pd.read_pickle("C:/Users/lundr/DataScienceJobs/data/indeed_raw_pickles/"+i)
    ads = pd.concat([ads,read_in],ignore_index = True, axis = 0, sort=True)

In [3]:
#drop rows with identical descriptions
ads = ads.drop_duplicates(['description'])

#reset index after dropping duplicated
ads.reset_index(inplace=True)

In [4]:
# clean data and create additional variables

ads['location'],ads['salary'],ads['jobtype'] = cf.clean_other_deets(ads['other_deets'])
ads['location'] = ads['location'].apply(lambda x: x.lstrip().rstrip() if pd.notnull(x) else x)
ads['full_description'] = cf.clean_column(ads['full_description'])
ads['company'] = cf.clean_column(ads['company'])
ads['salary_low'], ads['salary_high'],ads['salary_type'] = cf.create_split_salary_range(ads['salary'])
ads['salary_low']=cf.clean_salary(ads['salary_low'],"£")
ads['salary_high']=cf.clean_salary(ads['salary_high'],"£")
ads['days_from_post'] = cf.create_days_from_post(ads['date'])
ads['posted_date'] = cf.create_posted_date(ads['days_from_post'],ads['extraction_date'])

ads['salary_type'] = ads['salary_type'].str.replace('n ',"")
ads['salary_type'] = ads['salary_type'].str.replace(r"[\"\',]", '')
ads['salary_type'] = ads['salary_type'].str.replace(r" ", '')
ads['country']='UK'
ads['salary_type'] = cf.clean_salary_type(ads['salary_type'])

C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:112: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pandas_df_col[i] = str(pandas_df_col[i]).strip('[]')
C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:57: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if type(a[i])!="str":a[i]=str(a[i])
C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:59: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a[i]=(pattern.sub(lambda m: rep[re.escape(m.group(0))],a[i]))

In [33]:
# check for salary anomalies and manually correct if needed
idx = ads.loc[ads['salary_high'] != 'None']
idx[idx['salary_high']/idx['salary_low']>3]
#

C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\pandas\core\ops\__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

,index,company,date,description,extraction_date,full_description,job_title,jobtype,location,other_deets,...,country,salary_average,salary_average_euros,salary_low_euros,salary_high_euros,Region,currency,ref_code,url,region
2948,7972,Wokingham Borough Council,2 days ago,\n Preparation of reports and statistics (clas...,2019-11-13,Administrative Assistant Receptionist (AA )...,Administrative Assistant/Receptionist,Permanent,Wokingham,"Wokingham_Permanent_£6,000 - £19,171 a year",...,UK,12585.0,14346.9,6840.0,21854.94,South East,£,NaN,NaN,South East
3076,8264,Academic Minds,7 days ago,"\n Where applicable, the ability to use statis...",2019-11-13,Job SummaryWe are looking to recruit talented ...,Management Freelance Academic Writer,"Full-time, Part-time, Temporary, Permanent",King's Cross,"King's Cross_Full-time, Part-time, Temporary, ...",...,UK,150.0,171.0,57.0,285.00,London,£,NaN,NaN,London
4187,10683,Capita IT Resourcing,18 days ago,\nData Analysts - 3 month initial contract. Ne...,6-11-2019,Data Analysts - month initial contract Based...,Data Analyst,Contract,Sheffield,"Sheffield_Contract_£100 - £1,000 a day",...,UK,550.0,627.0,114.0,1140.00,Yorkshire and The Humber,£,NaN,NaN,Yorkshire and The Humber
4208,10725,Capita IT Resourcing,18 days ago,\n Data Analysts - 3 month initial contract.Ne...,6-11-2019,Data Analysts - month initial contract Based...,Data Analyst,Contract,Sheffield,"Sheffield_Contract_£100 - £1,000 a day",...,UK,550.0,627.0,114.0,1140.00,Yorkshire and The Humber,£,NaN,NaN,Yorkshire and The Humber
5799,14643,Cyber Tech Company,NaN,\n A new business sales/business development p...,11-11-2019,Sales Executive (Cyber Tech Company)London W ...,Sales Executive,"Full-time, Permanent",London,"London_Full-time, Permanent_£30,000 - £100,000...",...,UK,65000.0,74100.0,34200.0,114000.00,London,£,NaN,NaN,London
6075,15204,Cyber Tech Company,5 days ago,\nA new business sales/business development pr...,11-11-2019,Sales Executive (Cyber Tech Company)London W ...,Sales Executive,"Full-time, Permanent",London,"London_Full-time, Permanent_£30,000 - £100,000...",...,UK,65000.0,74100.0,34200.0,114000.00,London,£,NaN,NaN,London

In [5]:
#generate salary average after correction
ads['salary_average'] = cf.salary_average(ads['salary_low'],ads['salary_high'])

In [6]:
# force salary data to numeric
GBP = 1.14

ads['salary_average'] = pd.to_numeric(ads['salary_average'],errors='coerce')
ads['salary_low'] = pd.to_numeric(ads['salary_low'],errors='coerce')
ads['salary_high'] = pd.to_numeric(ads['salary_high'],errors='coerce')


# convert sary values to euros
ads['salary_average_euros'] = ads['salary_average']*GBP
ads['salary_low_euros'] = ads['salary_low']*GBP
ads['salary_high_euros'] = ads['salary_high']*GBP

In [7]:
# match locations to regions
ads['location']= ads['location'].apply(lambda x: str(x))
ads['Region'] = cf.check_locations(ads['location'],ads['country'])

#take first value from the string returned for regions
ads['Region'] = ads['Region'].apply(lambda x: x.split(",")[0])

C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:192: UserWarning: DataFrame columns are not unique, some columns will be omitted.
  lookup_UK = loc_UK.set_index('location').T.to_dict('list')

In [8]:
ads['Region'].unique()

array(['London', 'East of England', 'South West', 'West Midlands',
       'East Midlands', 'South East', 'Scotland',
       'Yorkshire and The Humber', 'North East', 'UK Unknown',
       'North West', 'Offshore', 'Wales', 'East', 'Northern Ireland', '',
       'East midlands'], dtype=object)

In [9]:
#Check that all areas are being picked up
ads[ads['Region']=='']['location'].unique()

array(['', 'nan'], dtype=object)

In [10]:
ads.loc[ads['Region']=='',['Region']]='UK Unknown'

In [11]:
# some places have multiple matches, create dictionary to correct

corrections = {"brentwood" :"East",
"kingston upon thames": "London",
"richmond upon thames" : "London",
"kentish town" : "London",
"hartlepool" : "North East",
"hemel hempstead" : "East",
"chesterfield" : "East Midlands",
"rotherham" : "Yorkshire and the Humber",
"london bridge station" : "London",
"sutton-in-ashfield" : "East Midlands",
"newcastle-under-lyme" : "West Midlands",
"great chesterford" : "East",
 "bridgend cf31" : "Wales"}

for i in range(len(ads['location'])):
     if ads['location'][i].lower() in corrections.keys():
        ads.loc[ads['location']==ads['location'][i],'Region'] = corrections[ads['location'][i].lower()]

In [12]:
# # standardize formats for regions 
# ads['Region'] = [str(x) for x in ads['Region']]
# ads['Region'] = [x.lower() for x in ads['Region']]

In [13]:
# make sure all missing values are np.nan
for x in range(ads.shape[0]):
    for y in range(ads.shape[1]):
        if ads.iloc[x,y] =='None' or ads.iloc[x,y] =='Nothing_found':
            ads.iloc[x,y] = np.nan

In [17]:
# job_title, company, description, salary, salary_low, salary_high, salary_average,salary_low_euros, salary_high_euros, salary_average_euros,  location, jobtype,posted_date, extraction_date, country, region
# job refcode
ads['currency'] = ads['country']
ads['currency'] =ads['currency'].map({"UK":"£","GER":"€","USA":"$"})
ads['ref_code'] = np.nan
ads['url'] = np.nan
ads['region'] = ads['Region']
data_to_database = ads[['job_title','ref_code', 'company', 'description', 'salary', 'salary_low', 'salary_high','currency','salary_average','salary_low_euros', 'salary_high_euros', 'salary_average_euros', 'salary_type', 'location', 'jobtype','posted_date', 'extraction_date', 'country','url','region']]

In [19]:
data_to_database

,job_title,ref_code,company,description,salary,salary_low,salary_high,currency,salary_average,salary_low_euros,salary_high_euros,salary_average_euros,salary_type,location,jobtype,posted_date,extraction_date,country,url,region
0,Intelligence Officer,NaN,Secret Intelligence Service,\n As an intelligence officer your focus will ...,"£33,800 - £42,700 a year",33800.0,42700.0,£,38250.0,38532.00,48678.00,43605.00,yearly,London,NaN,NaN,2019-11-13,UK,NaN,London
1,Business and Engagement Officers,NaN,Norfolk County Council,\n This post will also involve a certain amoun...,"£29,636 - £31,371 a year",29636.0,31371.0,£,30503.0,33785.04,35762.94,34773.42,yearly,Norwich,"Full-time, Part-time, Permanent",2019-11-13 00:00:00,2019-11-13,UK,NaN,East of England
2,Business Insights and Intelligence Manager-6 m...,NaN,Celgene,\n Knowledge of specific Business Intelligence...,NaN,NaN,NaN,£,NaN,NaN,NaN,NaN,NaN,Hillingdon,Temporary,2019-11-12 00:00:00,2019-11-13,UK,NaN,London
3,Business Intelligence Analyst,NaN,Com,\n Applying analytical rigour when developing ...,"£35,000 - £50,000 a year",35000.0,50000.0,£,42500.0,39900.00,57000.00,48450.00,yearly,Bournemouth,NaN,NaN,2019-11-13,UK,NaN,South West
4,Business Intelligence Assistant,NaN,Honeycomb Group,\n You’ll be working with the Business Intelli...,"£26,250 a year",26250.0,26250.0,£,26250.0,29925.00,29925.00,29925.00,yearly,Stoke-on-Trent ST4,NaN,2019-10-25 00:00:00,2019-11-13,UK,NaN,West Midlands
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7519,Machine Learning Specialist,NaN,Churchill Frank,\nWorking on Machine Learning algorithms and e...,NaN,NaN,NaN,£,NaN,NaN,NaN,NaN,NaN,London,Permanent,2019-10-12 00:00:00,11-11-2019,UK,NaN,London
7520,Data Scientist (AI / ML),NaN,Michael Page UK,\nDevelop new opportunities to deploy machine ...,"£40,000 - £45,000 a year",40000.0,45000.0,£,42500.0,45600.00,51300.00,48450.00,yearly,Bristol,Permanent,2019-10-12 00:00:00,11-11-2019,UK,NaN,South West
7521,Data Scientist,NaN,V Group Limited,\nExperience using advanced Machine Learning t...,NaN,NaN,NaN,£,NaN,NaN,NaN,NaN,NaN,Glasgow,Permanent,2019-11-06 00:00:00,11-11-2019,UK,NaN,Scotland
7522,Data Scientist,NaN,White Ops,"\nDevelop algorithms (i.e. rule based, statist...",NaN,NaN,NaN,£,NaN,NaN,NaN,NaN,NaN,London,NaN,2019-10-12 00:00:00,11-11-2019,UK,NaN,London
7523,UK 2020 Graduate Design Engineer,NaN,Dyson,"\nWorking with engineers, scientists and techn...",NaN,NaN,NaN,£,NaN,NaN,NaN,NaN,NaN,Malmesbury,NaN,2019-10-27 00:00:00,11-11-2019,UK,NaN,South West

In [24]:
#pickle out to keep a copy and then push to the database
#data_to_database.to_pickle("C:/Users/lundr/DataScienceJobs/data/indeed_uk_CLEAN_15-11-19.pkl")

PASSWORD = pd.read_pickle('C:/Users/lundr/DataScienceJobs/data/SQL_password.pkl')

from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:'+PASSWORD.iloc[0,0]+'@dsj-1.c9mo6xd9bf9d.us-west-2.rds.amazonaws.com:5432/')
conn2 = engine.raw_connection()

data_to_database.to_sql(name = 'all_data',con = engine, if_exists='append',  index=False)

In [15]:

table_data = ads[ads['salary_type']=='yearly']
#table_data.reset_index(inplace=True)
table_data.groupby(by='Region').agg({'salary_average' : ['count','median','mean','max','min']}).reset_index().sort_values(by =('salary_average', 'mean'))

                      Region salary_average                                   \
                                      count   median          mean       max
2              East midlands              1  19806.0  19806.000000   19806.0
7           Northern Ireland              3  18000.0  21166.666667   27500.0
1              East Midlands             97  33797.0  33521.432990   70000.0
13                     Wales             50  31291.5  33769.060000   55000.0
5                 North East             35  30500.0  34017.571429  100000.0
15  Yorkshire and The Humber            116  32831.0  34773.543103  100000.0
6                 North West            153  34330.0  35649.013072   90000.0
0                       East             18  33167.0  35987.000000   73000.0
11                South West            160  33898.0  36015.575000   80000.0
9                   Scotland             51  31250.0  36085.588235   80000.0
3            East of England            149  35000.0  36767.120805   87500.0
14             West Midlands            171  35632.0  37401.976608   85000.0
10                South East            285  35000.0  39110.084211  110000.0
12                UK Unknown            228  45000.0  47971.469298  125000.0
4                     London            949  47500.0  53038.200211  152500.0
8                   Offshore              1  75000.0  75000.000000   75000.0


        min
2   19806.0
7   18000.0
1    9125.0
13  18172.0
5   17007.0
15  10791.0
6   12191.0
0   18000.0
11  15487.0
9   18647.0
3   16436.0
14  18157.0
10  12585.0
12  11402.0
4   14442.0
8   75000.0

In [18]:
ads[(ads['Region']=='East Midlands') & (ads['salary_average'] < 15000)]

,index,company,date,description,extraction_date,full_description,job_title,jobtype,location,other_deets,...,country,salary_average,salary_average_euros,salary_low_euros,salary_high_euros,Region,currency,ref_code,url,region
191,408,Beauhurst,18 days ago,\n You’ll have or be working towards a degree ...,2019-11-13,About you We’re looking for someone who’s dili...,Data Intern – Nottingham,Internship,Nottingham,Nottingham_Internship_£300 a week,...,UK,300.0,342.00,342.000,342.0000,East Midlands,£,NaN,NaN,East Midlands
238,523,Catch Resource Management Ltd,30+ days ago,\n Our leading end user client is currently lo...,2019-11-13,Our leading end user client is currently looki...,Business Intelligence Analyst,Contract,Leicestershire,Leicestershire_Contract_£400 - £500 a day,...,UK,450.0,513.00,456.000,570.0000,East Midlands,£,NaN,NaN,East Midlands
1901,4431,Clark James Ltd,Just posted,\n Clark James are an established recruitment ...,2019-11-13,Clark James are an established recruitment bus...,Data Manager / Resourcer,Part-time,Caistor,Caistor_Part-time_£8.30 - £8.31 an hour,...,UK,8.0,9.12,9.462,9.4734,East Midlands,£,NaN,NaN,East Midlands
2711,7504,Leicester College,2 days ago,\n You will provide a comprehensive welfare an...,2019-11-13,Welfare Assistant Student Services Part Time...,Welfare Assistant,None,Leicester,"Leicester_£8,771 - £9,480 a year",...,UK,9125.0,10402.50,9998.940,10807.2000,East Midlands,£,NaN,NaN,East Midlands
2761,7576,Leicester College,6 days ago,\n Part Time (18.5 hours to be worked Wed - Fr...,2019-11-13,Welfare Advisor Student Services Part Time (...,Welfare Advisor,None,Leicester,"Leicester_£12,095 - £12,987 a year",...,UK,12541.0,14296.74,13788.300,14805.1800,East Midlands,£,NaN,NaN,East Midlands
2784,7612,Leicester College,7 days ago,\n We will store your details for a period of ...,2019-11-13,Part Time Lecturers Skills for Life Maths an...,Part Time Lecturer,Part-time,Leicester,Leicester_Part-time_£20.30 - £22.50 an hour,...,UK,21.0,23.94,23.142,25.6500,East Midlands,£,NaN,NaN,East Midlands
4171,10645,SF Group,6 days ago,\n The Data Analyst will be responsible for ma...,6-11-2019,SF Recruitment is currently recruiting for a T...,Temporary Data Analyst,Temporary,Nottingham,Nottingham_Temporary_£12.75 an hour,...,UK,12.0,13.68,14.535,14.5350,East Midlands,£,NaN,NaN,East Midlands

In [61]:
np.mean(table_data['salary_average'])

39204.90817064353

In [169]:
table_data[table_data['salary_low']>2000].groupby(['Region']).agg({'salary_average' : ['sum']}).reset_index()

                      Region salary_average
                                        sum
0                        0.0      7224610.0
1              east midlands      2867602.0
2            east of england      5807767.0
3                isle of man        75000.0
4                     london     49782311.0
5                 north east      1173608.0
6                 north west      5528399.0
7           northern ireland        63500.0
8                     remote       353000.0
9                   scotland      1840365.0
10                south east     11882848.0
11                south west      5884992.0
12                        uk      2704878.0
13                   unknown       344007.0
14                     wales      1707453.0
15             west midlands      6695238.0
16  yorkshire and the humber      4383188.0

In [76]:
table_data[table_data['salary_low']>2000].groupby(['Region']).mean().reset_index()

,Region,index,industry,education,career,ref_code
0,0,11557.141844,NaN,NaN,NaN,NaN
1,Belfast,10341.000000,NaN,NaN,NaN,NaN
2,East,8414.854167,NaN,NaN,NaN,NaN
3,East Midlands,8727.572917,NaN,NaN,NaN,NaN
4,East midlands,9396.000000,NaN,NaN,NaN,NaN
5,East of England,9411.188525,NaN,NaN,NaN,NaN
6,Isle of Man,9155.000000,NaN,NaN,NaN,NaN
7,Kent,6292.666667,NaN,NaN,NaN,NaN
8,London,10014.237234,NaN,NaN,NaN,NaN
9,London,18272.000000,NaN,NaN,NaN,NaN
10,North West,15532.333333,NaN,NaN,NaN,NaN
11,North East,9259.352941,NaN,NaN,NaN,NaN
12,North West,7741.777778,NaN,NaN,NaN,NaN
13,Remote,9337.333333,NaN,NaN,NaN,NaN
14,Scotland,8293.705882,NaN,NaN,NaN,NaN
15,South East,8899.344948,NaN,NaN,NaN,NaN
16,South Essex,4222.000000,NaN,NaN,NaN,NaN
17,South West,8631.875776,NaN,NaN,NaN,NaN
18,UK,8642.932203,NaN,NaN,NaN,NaN
19,Unknown,7235.444444,NaN,NaN,NaN,NaN
20,Wales,7379.549020,NaN,NaN,NaN,NaN
21,West Midlands,16758.333333,NaN,NaN,NaN,NaN
22,West Midlands,8019.529070,NaN,NaN,NaN,NaN
23,West Yorkshire,11815.500000,NaN,NaN,NaN,NaN
24,Yorkshire and The Humber,8860.876289,NaN,NaN,NaN,NaN
25,Yorkshire and the humber,7386.529412,NaN,NaN,NaN,NaN

In [ ]:
# generate missing columns
# drop unneeded columns
ads = ads.drop(['description', 'other_deets'], axis=1)